{
    "birth": {
        "date": "1984-06-12",
        "shorttext": "Birth in Paris",
        "longtext": "I was born in Paris (11th arondissement) to Daniel and Rose-Marie Rigot, with 2 older sisters Mélina and Adeline.",
        "symbol": "👶"
    },
    "categories": {
        "Family" : {
            "symbol": "👨‍🍼",
            "events": {
                "2001-07-01" : {
                    "shorttext": "Natân born",
                    "longtext": "Little brother from another mother."
                },
                "2009-12-27": {
                    "shorttext": "Met Vanessa",
                    "longtext": "Common friend Elise was in town for the week-end, had to compress her schedule and see us both on the same day. Oh, hello!"
                },
                "2012-06-09": {
                    "shorttext": "Married Vanessa",
                    "longtext": "I married Vanessa Paquerot on 6/9, in Montgobert, Picardie, because it was the cheapest genuine little castle we could rent that you could get to from Paris by train."
                },
                "2013-03-08": {
                    "shorttext": "Dad died",
                    "longtext": "In Créteil, after a year of suffering and false hopes."
                },
                "2014-09-20": {
                    "shorttext": "Lila born",
                    "longtext": "Right back home from work on a Friday night, we rushed to California Pacific Medical Center, where she was born the next morning."
                },
                "2023-04-26": {
                    "shorttext": "Ava born",
                    "longtext": "Showed up at 4am at Elmhurst Memorial for an induction, but had to wait all day because too many ladies showed up unexpectedly! She was born that evening, though."
                }
            }
        },
        "School and Work": {
            "symbol": "👨‍💻",
            "events": {
                "1994-09-01": {
                    "shorttext": "Started middle school",
                    "longtext": "In Notre-Dame de Valbenoite, in Saint-Étienne. Participate in a bunch of musical theater."
                },
                "1998-09-01": {
                    "shorttext": "Started high school",
                    "longtext": "In Notre-Dame de Valbenoite Le Rond-Point, in Saint-Étienne. Long walk every day."
                },
                "2001-09-01": {
                    "shorttext": "Started college",
                    "longtext": "First year of undergraduate studies in Maths & Computer Science, at Université Jean Monnet in Saint-Étienne."
                },
                "2002-07-02": {
                    "shorttext": "Joined Hôtel Ténor",
                    "longtext": "First job, two-star business hotel that kept me funded through my Saint-Étienne college years. I was the reception manager after a few months."
                },
                "2007-09-24": {
                    "shorttext": "Joined SQLI",
                    "longtext": "Consulting about various things, mostly helping the French government maintain their agricultural database (for real)."
                },
                "2008-01-01": {
                    "shorttext": "Joined Clever Age",
                    "longtext": "As a web dev, then project manager, then head of internal tools, then working on international expansion."
                },
                "2012-10-01": {
                    "shorttext": "Joined Steerious",
                    "longtext": "Still doing other things at Clever Age, this was a Clever Age product, which I was leading."
                },
                "2013-05-01": {
                    "shorttext": "Joined prismic.io",
                    "longtext": "CMS in the cloud. Was a dev evangelist."
                },
                "2014-07-14": {
                    "shorttext": "Joined Apple",
                    "longtext": "Engineer on localization tools. Worked on a number of things, including the very first Apple Watch."
                },
                "2015-07-15": {
                    "shorttext": "Co-founded Holberton",
                    "longtext": "Software engineering school, later grew to dozens of campuses worldwide (but I was gone already)."
                },
                "2016-05-01": {
                    "shorttext": "Joined Salesforce",
                    "longtext": "Engineer on in-app user assistance experiences in Salesforce Lightning. I built the walkthrough player that is still in Salesforce now (I think)."
                },
                "2017-12-28": {
                    "shorttext": "Joined Kenna Security",
                    "longtext": "Engineering Manager in a data analytics company about cybersecurity data. Later got acquired by Cisco."
                },
                "2019-11-01": {
                    "shorttext": "Joined Salesforce (again)",
                    "longtext": "Engineer on some customer-facing features, first in Essentials Cloud, then COVID relief products, and then in Slack for Sales Cloud."
                },
                "2022-04-08": {
                    "shorttext": "Moved to dev experience",
                    "longtext": "Still at Salesforce, but working on dev tooling, most focused on SCM, and somewhat on CI."
                }
            }
        },
        "Location": {
            "symbol": "🏠",
            "events": {
                "1988-08-16": {
                    "shorttext": "Moved to Saint-Étienne",
                    "longtext": "Parent separating, going back to mother's hometown."
                },
                "2006-08-24": {
                    "shorttext": "Moved to Maryville, MO",
                    "longtext": "Two whole semesters as an exchange student in Northwest Missouri State. Go Bearcats."
                },
                "2007-05-11": {
                    "shorttext": "Moved back to Saint-Étienne",
                    "longtext": "Temporarily while I'm interviewing all over France for my first job in tech."
                },
                "2007-07-10": {
                    "shorttext": "Moved to Paris",
                    "longtext": "First tech job found, I spent over a month seeking a room in the saturated Parisian rental market."
                },
                "2013-09-22": {
                    "shorttext": "Immigrated to the US",
                    "longtext": "Landed in San Francisco ready to conquer the world, but took the Bay Bridge and headed to West Oakland instead."
                },
                "2013-09-29": {
                    "shorttext": "Moved to downtown San Francisco",
                    "longtext": "West Oakland was rough. Stayed in hotel for a few weeks, then found an appartment across the street."
                },
                "2014-12-18": {
                    "shorttext": "Moved to San Jose, CA",
                    "longtext": "Getting closer to Cupertino for a decent commute. Outdoor spa in the backyard, nice."
                },
                "2015-11-10": {
                    "shorttext": "Moved back to San Francisco",
                    "longtext": "In the Outer Sunset. Could see the ocean through the window if you squinted really hard."
                },
                "2016-05-20": {
                    "shorttext": "Moved to Chicago",
                    "longtext": "Had never been. Stayed in dusty AirBnb for 2 months. Go Bears."
                },
                "2016-8-2": {
                    "shorttext": "Moved in Chicago",
                    "longtext": "Settled in a Roscoe Village condo for a bit. First-time buyers."
                },
                "2019-4-1": {
                    "shorttext": "Moved to Glen Ellyn",
                    "longtext": "Suburban village with ~30k people, peace and quiet."
                }
            }
        },
        "Misc" : {
            "symbol": "🤷‍♂️",
            "events": {
                "2013-05-15": {
                    "shorttext": "1st book",
                    "longtext": "Published by Eyrolles, about web project management in the case of responsive web design websites.",
                    "symbol": "📖"
                },
                "2018-01-02": {
                    "shorttext": "2nd book",
                    "longtext": "Published by D-BookeR, about the Go programming language, specifically when to use it and not use it.",
                    "symbol": "📖"
                },
                "2020-12-22": {
                    "shorttext": "Became American",
                    "longtext": "In the middle of a pandemic, not much of a grandiose ceremony, but still a big deal.",
                    "symbol": "🇺🇸"
                }
            }
        }
    }
}